#### BuiltInFailures.FabricSheetFailures Members

---

|  |
| --- |
| BuiltInFailures FabricSheetFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures FabricSheetFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | BentFabricSheetTooLongBendingProfile | The bent edge is shorter than the bend profile for this fabric sheet type. |
| Public property Static member | FabricSheetOutSideOfHostError | Fabric Sheet is placed completely outside of its host. |
| Public property Static member | FabricSheetOutSideOfHostWarning | Fabric Sheet is placed completely outside of its host. |

# See Also

BuiltInFailures FabricSheetFailures Class

Autodesk.Revit.DB Namespace